// 변수

어떠한 저장소에 정보를 담는 것

    var car = "car";

    변수 변수명  변수값

변수에 값을 주는 행위를 선언한다 라고 한다.

1. var  // 사용하지 않는다. 한번 선언된 변수의 값을 바꿀 수 있다.

2. let 한번 선언된 변수의 값을 바꿀 수 있다. // css --> class
--> 유동성있게 사용할 수 있다.
    사용자가 정보를 수정하거나 입력하는 용도로 사용 가능

3. const 한번 선언된 변수의 값은 수정이 불가하다. // css --> id

--> 제한적으로 코드를 작성할 수 있다.
   한번 선언된 변수의 값은 변하지 않기 때문에 보안에 좋음


   1. 변수는 문자와 숫자만 사용 // 예를들어 let ^-^ = "이모티콘웃음"; 불가능

   2. 첫 글자는 숫자가 될 수 없음
   // let 1number = "숫자1"; 불가능
   // let number1 = "숫자1"; 가능

   3. 예약어는 사용할 수 없다 // let let = "숫자1"; 불가능

   4. 변수명은 읽기 쉽고 이해하기 쉽게 만든다
   --> 협업을 해야하기 때문에 다른 사람이 봤을때도 알아볼 수 있게 직관적인 네이밍을 해야함
